{
    "results": [
        {
            "post_id": "10116522560787531",
            "type": "post",
            "url": "https://www.facebook.com/zuck/posts/pfbid02XRjrn2doynoJX4gBArrQfs4Pem8yd2gHJSEQJuAZzxehB9h4ergz3FnU36Ph9NZgl",
            "message": "Just shared Meta's quarterly earnings report. AI continues to transform everything we do -- Meta AI now has almost 1 billion monthly actives, we're making good progress on AI glasses, and we're seeing good trends across our apps.\n\nHere's the full transcript of what I said:\n\nWe've had a strong start to the year. Our community keeps growing with more than 3.4 billion people now using at least one of our apps each day. Our business is also performing very well -- and I think we're well-positioned to navigate the macro economic uncertainty.\n\nThe major theme right now of course is how AI is transforming everything we do. And as we continue to increase our investments and focus more of our resources on AI, I thought it would be useful today to lay out the five major opportunities we're focused on. Those are: improved advertising, more engaging experiences, business messaging, Meta AI, and AI devices. These are each long term investments that are downstream from us building general intelligence and leading AI models and infrastructure. Even with our significant investments, we don't need to succeed in all of these areas to have a good ROI. But if we do, then I think we will be wildly happy with the investments that we are making. \n\nThe first opportunity is improved advertising. Our goal is to make it so any business can basically tell us what objective they're trying to achieve -- like selling something or getting a new customer -- and how much they're willing to pay for each result, and then we just do the rest. Businesses used to have to generate their own ad creative and define what audiences they wanted to reach. But AI has already made us better at targeting and finding the audiences that will be interested in their product than many businesses are themselves, and that keeps improving. And now AI is generating better creative options for many businesses as well. I think this is really redefining what advertising is into an AI agent that delivers measurable business results at scale. If we deliver on this vision, then over the coming years I think the increased productivity from AI will make advertising a meaningfully larger share of global GDP than it is today. \n\nIn just the last quarter, we're testing a new ads recommendation model for Reels, which has already increased conversion rates by 5%. And we're seeing 30% more advertisers are using AI creative tools in the last quarter as well.\n\nThe second opportunity is more engaging experiences. This will come in two forms: better recommendations for existing content types, and better, new types of content.\n\nIn the last six months, improvements to our recommendation systems have led to a 7% increase in time spent on Facebook, 6% increase on Instagram, and 35% on Threads. Threads now also has more than 350 million monthly actives and continues to be on track to become our next major social app.\n\nIn addition to better recommendations for existing content types, AI is also enabling the creation of better content as well. Some of this will be helping people produce better content to share themselves. Some of this will be AI generating content directly for people that is personalized for them. Some of this will be in existing formats like photos and videos, and some will be increasingly interactive. I've often talked about this long term trend of content becoming richer over time. Our feeds started mostly with text, and then became mostly photos when we all got mobile phones with cameras, and then became mostly video when mobile networks became fast enough to handle that well. We're now in the video era, but I don't think this is the end of the line. In the near future I think we'll have content in our feeds that you can interact with and that it'll interact back with rather than you just watching it.\n\nOver the long term, as AI unlocks more productivity in the economy, I also expect people will spend more of their time on entertainment and culture, which will create an even larger opportunity to create more engaging experiences across all of these apps.\n\nThe third opportunity is business messaging. Right now the vast majority of our business is advertising in feeds on Facebook and Instagram. But WhatsApp now has more than 3 billion monthly actives, with more than 100 million in the US and growing quickly there. Messenger is also used by more than a billion people each month, and there are now as many messages sent each day on Instagram as there are on Messenger. Business messaging should be the next pillar of our business.\n\nIn countries like Thailand and Vietnam where there is a low cost of labor, we see many businesses conduct commerce through our messaging apps. There is actually so much business through messaging that those countries are both in our top 10 or 11 by revenue even though they're ranked in the 30s in global GDP. This phenomenon hasn't yet spread to developed countries because the cost of labor is too high to make this a profitable model before AI -- but AI should solve this. \n\nIn the next few years, I expect that just like every business today has an email address, social media account, and website, they'll also have an AI business agent that can do customer support and sales. And they should be able to set that up very easily given all the context that they've already put into our business platforms.\n\nWe're going to have more to share on upcoming calls about our progress in this area.\n\nThe fourth opportunity is Meta AI. Across our apps, there are now almost a billion monthly actives using Meta AI.  Our focus for this year is deepening the experience and making Meta AI the leading personal AI -- with an emphasis on personalization, voice conversations, and entertainment. I think that we're all going to have an AI that we talk to throughout the day -- while we're browsing content on our phones, and eventually as we're going through our days with glasses -- and I think this will be one of the most important and valuable services that has ever been created.\n\nIn addition to building Meta AI into our apps, we just released our first Meta AI standalone app. It is personalized so you can talk to you about interests you've shown while browsing Reels or across our apps. And we built a social feed into it so you can discover entertaining ways that others are using Meta AI. Initial feedback on the app has been good so far. \n\nOver time, I expect the business opportunity for Meta AI to follow our normal product development playbook. First we build and scale the product, and then once it's at scale then we focus on revenue. In this case, I think there will be a large opportunity to show product recommendations or ads, as well as a premium service for people who want to unlock more compute for additional functionality or intelligence. But I expect that we'll largely be focused on scaling and deepening engagement for at least the next year before we'll really be ready to start building out the business here.\n\nThe fifth opportunity is AI devices, which is increasingly how we're thinking about our work on the next generation of computing platforms. Glasses are the ideal form factor for both AI and the metaverse. They enable you to let an AI see what you see, hear what you hear, and talk to you throughout the day. And they let you blend the physical and digital worlds together with holograms. More than a billion people worldwide wear glasses today, and it seems highly likely that these will become AI glasses over the next 5 to 10 years. Building the devices that people use to experience our services lets us deliver the highest quality AI and social experiences. This will serve as an amplifier on all the opportunities I've mentioned so far, as well as unlocking some new opportunities as well.\n\nRay-Ban Meta AI glasses have tripled in sales in the last year and people who have them are using them a lot. We've got some exciting new launches with our partner EssilorLuxottica later this year as well that should expand that category and add some new technological capabilities to the glasses.\n\nOn Quest, we're also seeing deeper engagement as Quest 3S makes VR accessible to more people, and more people are creating experiences in Horizon with AI tools.\n\nNow everything that I've talked about today is built on top of our AI models and infrastructure. We released the first Llama 4 models earlier this month -- and they are some of the most intelligent, best multi-modal, lowest latency, and most-efficient models that anyone has built. We have more models on the way, including the massive Llama 4 Behemoth model.\n\nOverall, we are focused on building full general intelligence. All of the opportunities that I've discussed today are downstream of delivering general intelligence and doing so efficiently. The pace of progress across the industry and the opportunities ahead for us are staggering. I want to make sure we're working aggressively and efficiently, and I also want to make sure that we build out the leading infrastructure and teams we need to achieve our goals.\n\nSo to that end, we're accelerating some of our efforts to bring capacity online more quickly this year as well as some longer term projects that will give us the flexibility to add capacity in the coming years as well. That has increased our planned investment for this year.\n\nMore broadly, this has been a good start to what I expect will continue to be an intense year. We've got a lot more exciting work in the pipeline that I'm looking forward to sharing soon. I continue to think that this year is going to be a pivotal moment for our industry. I'm grateful for everyone who is working so hard at the company to deliver all this amazing technology and new experiences. As always, thank you for being on this journey with us.",
            "timestamp": 1746047835,
            "comments_count": 119668,
            "reactions_count": 322418,
            "reshare_count": 21072,
            "reactions": {
                "angry": 439,
                "care": 5149,
                "haha": 1201,
                "like": 257589,
                "love": 56198,
                "sad": 129,
                "wow": 1713
            },
            "author": {
                "id": "4",
                "name": "Mark Zuckerberg",
                "url": "https://www.facebook.com/zuck",
                "profile_picture_url": "https://scontent.fcpq14-1.fna.fbcdn.net/v/t39.30808-1/461204377_10115852257979731_20136418769041878_n.jpg?stp=c180.30.1429.1428a_cp0_dst-jpg_s40x40_tt6&_nc_cat=1&ccb=1-7&_nc_sid=1d2534&_nc_ohc=Fwgk2Z-aYCIQ7kNvwHe4fP1&_nc_oc=Adk-ZkMxD90y7Qskfl0LQAh1XTr8WkUJ6RuSycOdCusoZwmNeHO9ybFjlJpD91-Il70&_nc_zt=24&_nc_ht=scontent.fcpq14-1.fna&_nc_gid=51khDm0Uq6DoPuLeNV8X0A&oh=00_AfIeLJp8odeYzFJ7O-g5i4r-m3fVAq1vZufxAzFP_wyPRw&oe=68278E30"
            },
            "image": null,
            "video": null,
            "album_preview": null,
            "video_files": null,
            "video_thumbnail": null,
            "external_url": null,
            "attached_event": null,
            "attached_post": null,
            "attached_post_url": null
        },
        {
            "post_id": "10116519197602381",
            "type": "post",
            "url": "https://www.facebook.com/reel/1194067775494747/",
            "message": "New Meta AI app out today! Almost a billion monthly actives use Meta AI across our apps so we dropped a new standalone app. Check it out!",
            "timestamp": 1745938625,
            "comments_count": 183558,
            "reactions_count": 852979,
            "reshare_count": 63671,
            "reactions": {
                "angry": 1213,
                "care": 10920,
                "haha": 5015,
                "like": 704890,
                "love": 126031,
                "sad": 318,
                "wow": 4592
            },
            "author": {
                "id": "4",
                "name": "Mark Zuckerberg",
                "url": "https://www.facebook.com/zuck",
                "profile_picture_url": "https://scontent.fcpq14-1.fna.fbcdn.net/v/t39.30808-1/461204377_10115852257979731_20136418769041878_n.jpg?stp=c180.30.1429.1428a_cp0_dst-jpg_s40x40_tt6&_nc_cat=1&ccb=1-7&_nc_sid=1d2534&_nc_ohc=Fwgk2Z-aYCIQ7kNvwHe4fP1&_nc_oc=Adk-ZkMxD90y7Qskfl0LQAh1XTr8WkUJ6RuSycOdCusoZwmNeHO9ybFjlJpD91-Il70&_nc_zt=24&_nc_ht=scontent.fcpq14-1.fna&_nc_gid=51khDm0Uq6DoPuLeNV8X0A&oh=00_AfIeLJp8odeYzFJ7O-g5i4r-m3fVAq1vZufxAzFP_wyPRw&oe=68278E30"
            },
            "image": null,
            "video": "https://www.facebook.com/reel/1194067775494747/",
            "album_preview": null,
            "video_files": {
                "video_sd_file": "https://video.fcpq14-1.fna.fbcdn.net/o1/v/t2/f2/m69/AQPx9GOUxsTNVEUvevqrpTPvHzFVX_d6OwK1s6MgwXPGHhYfDSvCYeOFgj7AsfNqRLNVwTzpmjK47nbPtLH0UPnc.mp4?strext=1&_nc_cat=111&_nc_oc=AdlPpofSJme_wklSM1ZcWhQDkew56yzjlOG5NBLaJgh4DAGu3FrZbQAyJxX-szEWYeM&_nc_sid=8bf8fe&_nc_ht=video.fcpq14-1.fna.fbcdn.net&_nc_ohc=v58AkU86Z2IQ7kNvwH73zsi&efg=eyJ2ZW5jb2RlX3RhZyI6Inhwdl9wcm9ncmVzc2l2ZS5GQUNFQk9PSy4uQzMuMzYwLnN2ZV9zZCIsInhwdl9hc3NldF9pZCI6MTAyNzUxNDg2ODgzNTczMSwidmlfdXNlY2FzZV9pZCI6MTAxMjAsImR1cmF0aW9uX3MiOjcyLCJ1cmxnZW5fc291cmNlIjoid3d3In0%3D&ccb=17-1&_nc_zt=28&oh=00_AfJl3-8r86RmyguerQhAijMqEXmIP04heTXb7dIDjJAoYw&oe=6827848F",
                "video_hd_file": "https://video.fcpq14-1.fna.fbcdn.net/o1/v/t2/f2/m69/AQMZhplHjVvFf0LApvF1YxZY_qbxapAW7E7TghuJQk5Ad5IkkoUa5pBILpbrSrTRxREzUwhSTD06Xwx3M1bVrytk.mp4?strext=1&_nc_cat=100&_nc_oc=AdkLL1YdW3HpfYDj9nBhYhYeS2bpbbOvqZ2CJ84GQIBHYW7v6gYwy4j5yiVlSouotdI&_nc_sid=5e9851&_nc_ht=video.fcpq14-1.fna.fbcdn.net&_nc_ohc=43oYpR1ErZYQ7kNvwH_--Vc&efg=eyJ2ZW5jb2RlX3RhZyI6Inhwdl9wcm9ncmVzc2l2ZS5GQUNFQk9PSy4uQzMuNzIwLmRhc2hfaDI2NC1iYXNpYy1nZW4yXzcyMHAiLCJ4cHZfYXNzZXRfaWQiOjEwMjc1MTQ4Njg4MzU3MzEsInZpX3VzZWNhc2VfaWQiOjEwMTIwLCJkdXJhdGlvbl9zIjo3MiwidXJsZ2VuX3NvdXJjZSI6Ind3dyJ9&ccb=17-1&vs=7b6cec5bafb36116&_nc_vs=HBksFQIYOnBhc3N0aHJvdWdoX2V2ZXJzdG9yZS9HRmgzZFIwNjFHTGs2UmNFQUdVMjJPRE12N01uYm1kakFBQUYVAALIAQAVAhg6cGFzc3Rocm91Z2hfZXZlcnN0b3JlL0dKSWVUQjF4V3ljbjJSc0dBQ0xTczBUeTA0UTRickZxQUFBRhUCAsgBACgAGAAbAogHdXNlX29pbAExEnByb2dyZXNzaXZlX3JlY2lwZQExFQAAJqaWkayeodMDFQIoAkMzLBdAUiiDEm6XjRgZZGFzaF9oMjY0LWJhc2ljLWdlbjJfNzIwcBEAdQJlkJ4BAA&_nc_zt=28&oh=00_AfKL5HbdniU3KleYJqRpPEOg5BA5rBD_5wMVe39DcpwUnw&oe=6827904E"
            },
            "video_thumbnail": "https://scontent.fcpq14-1.fna.fbcdn.net/v/t15.5256-10/491717392_1215094206681962_2071998961693936401_n.jpg?stp=dst-jpg_s960x960_tt6&_nc_cat=1&ccb=1-7&_nc_sid=7965db&_nc_ohc=FtWCUtOvIcYQ7kNvwGck4eV&_nc_oc=AdmetxjxE1woocNEGCVUSiQfdmCAOLtfwGYwnIStou6H6slW-_XUHdjus2mdp_c_hIw&_nc_zt=23&_nc_ht=scontent.fcpq14-1.fna&_nc_gid=51khDm0Uq6DoPuLeNV8X0A&oh=00_AfIseNO3STXzIaEyKf5bUIcgA59b_Bw05ssPtxPi6Ycz0w&oe=6827A2D3",
            "external_url": null,
            "attached_event": null,
            "attached_post": null,
            "attached_post_url": null
        },
        {
            "post_id": "10116513907628531",
            "type": "post",
            "url": "https://www.facebook.com/zuck/posts/pfbid0je5UYzPJexcdQV44pKMW7pj5mXPxtKTkoGbKCupEdRzDquRL77igwEsUuXoPRFmfl",
            "message": "Annual 5k run with Guerrilla fight crew. Finished a bit above 20 mins. Proud of the team! 💪",
            "timestamp": 1745780288,
            "comments_count": 87710,
            "reactions_count": 372900,
            "reshare_count": 17598,
            "reactions": {
                "angry": 246,
                "care": 5340,
                "haha": 1394,
                "like": 300037,
                "love": 62985,
                "sad": 86,
                "wow": 2812
            },
            "author": {
                "id": "4",
                "name": "Mark Zuckerberg",
                "url": "https://www.facebook.com/zuck",
                "profile_picture_url": "https://scontent.fcpq14-1.fna.fbcdn.net/v/t39.30808-1/461204377_10115852257979731_20136418769041878_n.jpg?stp=c180.30.1429.1428a_cp0_dst-jpg_s40x40_tt6&_nc_cat=1&ccb=1-7&_nc_sid=1d2534&_nc_ohc=Fwgk2Z-aYCIQ7kNvwHe4fP1&_nc_oc=Adk-ZkMxD90y7Qskfl0LQAh1XTr8WkUJ6RuSycOdCusoZwmNeHO9ybFjlJpD91-Il70&_nc_zt=24&_nc_ht=scontent.fcpq14-1.fna&_nc_gid=51khDm0Uq6DoPuLeNV8X0A&oh=00_AfIeLJp8odeYzFJ7O-g5i4r-m3fVAq1vZufxAzFP_wyPRw&oe=68278E30"
            },
            "image": {
                "uri": "https://scontent.fcpq14-1.fna.fbcdn.net/v/t39.30808-6/492552657_10116513907573641_291110498214921611_n.jpg?stp=dst-jpg_s720x720_tt6&_nc_cat=103&ccb=1-7&_nc_sid=833d8c&_nc_ohc=cWMt4Epk1JUQ7kNvwE2TDYC&_nc_oc=AdkhImMre6LohNfNv9LlwXzZF4jKtQFwoGm-iSVRUVfNqVffeU0lSNy8-YnqoB8s-QE&_nc_zt=23&_nc_ht=scontent.fcpq14-1.fna&_nc_gid=51khDm0Uq6DoPuLeNV8X0A&oh=00_AfJ6lLcB7yvGfpSxHyu8p3Gy8bdMw9AePByT8q39a4ajOg&oe=6827812C",
                "height": 720,
                "width": 524
            },
            "video": null,
            "album_preview": null,
            "video_files": null,
            "video_thumbnail": null,
            "external_url": null,
            "attached_event": null,
            "attached_post": null,
            "attached_post_url": null
        }
    ],
    "cursor": "Cg8Ob3JnYW5pY19jdXJzb3IJAAABL0FRSFI2bHVGMmlSQTdaOHo0V2pjT3JRbVlmQTM4dUp3WklFVzI3eXkxUks1YUhBYVp3WnphMEptMEN3bzdqcHVhRzVQNjBHVUF5VTFndUF1dm5ha242S3hOQ2FjekVPRVlQQzBuTWN3NGJoTHhDekhYRnA0ZlNZQ08xZDJvV2RFTjJZNWFHbzMxQ1c4YVRjR2pWRmg1eFhLeEt2a3d2elpWNllIUFVleFV4aDF2SjNRbjA0RHpjY05XWGlFUmpMUzAwUmVud3doajV6MndqeTBMSmtYZl85SkhBU2N3b1lUdDFrbHk3RVBMeU8yWDBsaWNUeUpFMDRqZ0ZkcGhxV2xPMi1BVHJXSm54ZUdGcHh5QmR5bG1lUThOSUV1RDdCM1RUdHlNQ2pGVm5sYUxlNA8JYWRfY3Vyc29yDg8PZ2xvYmFsX3Bvc2l0aW9uAgAPBm9mZnNldAIADxBsYXN0X2FkX3Bvc2l0aW9uAv8B"
}